In [37]:
import numpy as np
import pandas as pd
import seaborn as sns

In [16]:
links = pd.read_csv('C:/Users/rossi/Desktop/MLOps/Books/Dataset/links.csv', sep = ',')
movies = pd.read_csv('C:/Users/rossi/Desktop/MLOps/Books/Dataset/movies.csv', sep = ',')
tags = pd.read_csv('C:/Users/rossi/Desktop/MLOps/Books/Dataset/tags.csv', sep = ',')
ratings = pd.read_csv('C:/Users/rossi/Desktop/MLOps/Books/Dataset/ratings.csv', sep = ',')

In [17]:
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [18]:
tags = tags.drop(['timestamp'], axis=1)

In [7]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [8]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [19]:
ratings = ratings.drop(['timestamp'], axis=1)

In [21]:
print(tags.shape)
print(movies.shape)
print(ratings.shape)

(3683, 3)
(9742, 3)
(100836, 3)

tags - NaN знаечния отсутствуют, типы данных: int64, int64, object
movies - NaN знаечния отсутствуют, типы данных: int64, object, object
ratings - NaN знаечния отсутствуют, типы данных: int64, int64, float64

#### Простая рекомендашка, выводящая топы фильмов по рейтинку

In [40]:
rating_count = pd.DataFrame(ratings, columns=['movieId','rating'])

   movieId  rating
0        1     4.0
1        3     4.0
2        6     4.0
3       47     5.0
4       50     5.0

In [42]:
rating_count.sort_values('rating', ascending=False).drop_duplicates().head(10) #сортируем топ фильмов

       movieId  rating
34031     3147     5.0
50717     1080     5.0
18166      487     5.0
18165      480     5.0
76157     3308     5.0
18158      296     5.0
18157      260     5.0
50696      608     5.0
50698      750     5.0
50699      858     5.0

In [47]:
most_rated_books = pd.DataFrame([3147, 1080, 487, 480, 3308], index=np.arange(5), columns=['movieId']) 
most_rated_books
detail = pd.merge(most_rated_books, movies, on='movieId')
detail

,movieId,title,genres
0,3147,"Green Mile, The (1999)",Crime|Drama
1,1080,Monty Python's Life of Brian (1979),Comedy
2,487,Lightning Jack (1994),Comedy|Western
3,480,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller
4,3308,"Flamingo Kid, The (1984)",Comedy|Drama